In [1]:
import numpy as np
import pandas as pd

In [2]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,39]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     39

In [4]:
havaDurumuDataFrame.dropna()#bir sırada NaN var ise siler satırı

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     39

In [6]:
havaDurumuDataFrame.dropna(axis=0)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     39

In [8]:
yeniVeri = {"Istanbul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,39],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [9]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     39      NaN

In [10]:
yeniDataFrame.dropna(axis=1,thresh=2)#limit koy silmek için

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     39

In [11]:
yeniDataFrame.dropna(axis=0,thresh=2)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     39      NaN

In [12]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     39      NaN

In [13]:
#boş olan verilere değer ekle

In [14]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     39      NaN

In [15]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     39     20.0

In [16]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     39      NaN